//task name label
HSDTaskName = "Журналы факсов";

HSDFaxLogsDescription = "Используйте флажки для выбора номеров факсов, которые необходимо заблокировать или разблокировать, а затем щелкните «Применить».";

//Table view table titles
HSDTableColumnTitleType = "Тип";
HSDTableColumnTitleDate = "Дата";
HSDTableColumnTitleTime = "Время";
HSDTableColumnTitleDuration = "Длительность";
HSDTableColumnTitlePages = "Страницы";
HSDTableColumnTitleResult = "Результат";
HSDTableColumnTitleFaxNumber = "Номер факса";
HSDTableColumnTitleBlock = "Блокировать";

//Button titles
HSDPrintButtonTitle = "Печать журнала операций факса";
HSDApplyButtonTitle = "Применить";

//Printing progress title
PrintingProgressTitle = "Подождите, выполняется печать...";

//Table view menu items
ReceivedFaxesLogMenuItemTitle = "Журнал полученных факсов";
SentFaxesLogMenuItemTitle = "Журнал отправленных факсов";
AllFaxesLogMenuItemTitle = "Все журналы факсов";

//Max limit for fax blocking list reached error
FaxBlackListLimitErrorTitle = "Достигнуто максимальное количество заблокированных номеров";
FaxBlackListLimitErrorDescription = "Устройство позволяет сохранить максимум %d заблокированных номеров факсов. Разблокируйте некоторые номера и повторите попытку.";

// explanation why the fax setting were not applied
FaxNotAppliedExplanation = "Убедитесь, что устройство подключено к сети и не обрабатывает задачу отправки факса.";

//Fax session types
SentSessitonType = "Отправлено";
RecievedSessionType = "Получено";

//Fax log results
SuccessResultCode = "Успешно";
ErrorResultCode = "Ошибка";
BusyResultCode = "Занято";
NoAnswerResultCode = "Нет ответа";
NoDialToneResultCode = "Нет гудка";
NoDocumentResultCode = "Нет документа";
DocumentJamResultCode = "Замятие документа";
DoorOpenResultCode = "Открыта крышка";
PowerFailureResultCode = "Сбой питания";
BlacklistedResultCode = "Заблокировано";
StorageFullResultCode = "Нет места";
OutOfMemoryResultCode = "Недостаточно памяти";
PhoneLineUnavailableResultCode = "Телефонная линия недоступна";
FaxDisconnectedResultCode = "Факс отсоединен";
PCDisconnectedResultCode = "Компьютер отсоединен";
RemoteNotColorResultCode = "Получатель не поддерживает цвет";
CommunicationErrorResultCode = "Ошибка связи";
CancelledResultCode = "Отменено";
